Revit 2027 API
ExternalGeometryId.Id Property
 External geometry identifier.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Id { get; }
Public ReadOnly Property Id As String
	Get
public:
property String^ Id {
	String^ get ();
}
member Id : string with get
Property Value
String
See Also
Reference
ExternalGeometryId Class
Autodesk.Revit.DB Namespace